%%  
% GMM工具箱包含如下功能：
% 
% 1. 构建功能
%    a) 构建任意随机变量的边际分布-基于EM算法
%    b) 构建任意随机变量的边际分布-基于MAP算法
%    c) 构建任意多维随机变量的联合分布-基于EM算法
%    d) 构建任意多维随机变量的联合分布-基于MAP算法
%    e) 构建任意多维随机变量的条件分布-基于EM算法
%    f) 构建任意多维随机变量的条件分布-基于MAP算法
% 2. 计算功能
%    a) 计算在给定点的概率密度函数值
%    b) 计算在给定点的积累概率函数值
%    c) 计算任意两个分布之间的KL散度
%    d) 计算任意两个边际分布之间的RMSE
%    e) 计算随机变量的线性函数的分布
%    f) 计算随机变量的二次型函数的分布 ?
% 3. 绘图功能
%    a) 绘制单一维度的概率密度函数
%    b) 绘制测试集直方图和单一维度的概率密度函数
%    c) 绘制多维度的概率密度函数
%    d) 绘制单一维度的积累概率函数
%    e) 绘制多维度的积累概率函数
%    f) 绘制条件分布